fenrir-naru/gpib-usbcdc/firmware/c8051f380.h
/* IE 0xA8 */
__sbit __at (0xAF) EA           ; /* Global Interrupt Enable                  */
__sbit __at (0xAE) ESPI0        ; /* SPI0 Interrupt Enable                    */
__sbit __at (0xAD) ET2          ; /* Timer 2 Interrupt Enable                 */
__sbit __at (0xAC) ES0          ; /* UART0 Interrupt Enable                   */
__sbit __at (0xAB) ET1          ; /* Timer 1 Interrupt Enable                 */
__sbit __at (0xAA) EX1          ; /* External Interrupt 1 Enable              */
__sbit __at (0xA9) ET0          ; /* Timer 0 Interrupt Enable                 */
__sbit __at (0xA8) EX0          ; /* External Interrupt 0 Enable              */

/* IP 0xB8 */
                                   /* Bit 7 unused                           */
__sbit __at (0xBE) PSPI0        ; /* SPI0 Interrupt Priority                  */
__sbit __at (0xBD) PT2          ; /* Timer 2 Priority                         */
__sbit __at (0xBC) PS0          ; /* UART0 Priority                           */
__sbit __at (0xBB) PT1          ; /* Timer 1 Priority                         */
__sbit __at (0xBA) PX1          ; /* External Interrupt 1 Priority            */
__sbit __at (0xB9) PT0          ; /* Timer 0 Priority                         */
__sbit __at (0xB8) PX0          ; /* External Interrupt 0 Priority            */

/* SMB0CN 0xC0 SFR Page=0 */
__sbit __at (0xC7) MASTER0      ; /* SMBus0 Master/Slave Indicator            */
__sbit __at (0xC6) TXMODE0      ; /* SMBus0 Transmit Mode Indicator           */
__sbit __at (0xC5) STA0         ; /* SMBus0 Start Flag                        */
__sbit __at (0xC4) STO0         ; /* SMBus0 Stop Flag                         */
__sbit __at (0xC3) ACKRQ0       ; /* SMBus0 Acknowledge Request               */
__sbit __at (0xC2) ARBLOST0     ; /* SMBus0 Arbitration Lost Indicator        */
__sbit __at (0xC1) ACK0         ; /* SMBus0 Acknowledge                       */
__sbit __at (0xC0) SI0          ; /* SMBus0 Interrupt Flag                    */

/* SMB1CN 0xC0 SFR Page=F */
__sbit __at (0xC7) MASTER1      ; /* SMBus1 Master/Slave Indicator            */
__sbit __at (0xC6) TXMODE1      ; /* SMBus1 Transmit Mode Indicator           */
__sbit __at (0xC5) STA1         ; /* SMBus1 Start Flag                        */
__sbit __at (0xC4) STO1         ; /* SMBus1 Stop Flag                         */
__sbit __at (0xC3) ACKRQ1       ; /* SMBus1 Acknowledge Request               */
__sbit __at (0xC2) ARBLOST1     ; /* SMBus1 Arbitration Lost Indicator        */
__sbit __at (0xC1) ACK1         ; /* SMBus1 Acknowledge                       */
__sbit __at (0xC0) SI1          ; /* SMBus1 Interrupt Flag                    */

/* TMR2CN 0xC8 SFR Page=0 */
__sbit __at (0xCF) TF2H         ; /* Timer 2 High-Byte Overflow Flag          */
__sbit __at (0xCE) TF2L         ; /* Timer 2 Low-Byte  Overflow Flag          */
__sbit __at (0xCD) TF2LEN       ; /* Timer 2 Low-Byte Flag Enable             */
__sbit __at (0xCC) TF2CEN       ; /* Timer 2 Capture Enable                   */
__sbit __at (0xCB) T2SPLIT      ; /* Timer 2 Split-Mode Enable                */
__sbit __at (0xCA) TR2          ; /* Timer2 Run Enable                        */
__sbit __at (0xC9) T2CSS        ; /* Timer 2 Capture Source Select            */
__sbit __at (0xC8) T2XCLK       ; /* Timer 2 Clk/8 Clock Source               */

/* TMR2CN 0xC8 SFR Page=F */
__sbit __at (0xCF) TF5H         ; /* Timer 5 High-Byte Overflow Flag          */
__sbit __at (0xCE) TF5L         ; /* Timer 5 Low-Byte  Overflow Flag          */
__sbit __at (0xCD) TF5LEN       ; /* Timer 5 Low-Byte Flag Enable             */
                                   /* Bit 4 unused                           */
__sbit __at (0xCB) T5SPLIT      ; /* Timer 5 Split-Mode Enable                */
__sbit __at (0xCA) TR5          ; /* Timer 5 Run Enable                       */
                                   /* Bit 1 unused                           */
__sbit __at (0xC8) T5XCLK       ; /* Timer 5 Clk/8 Clock Source               */

/* PSW 0xD0 */
__sbit __at (0xD7) CY           ; /* Carry Flag                               */
__sbit __at (0xD6) AC           ; /* Auxiliary Carry Flag                     */
__sbit __at (0xD5) F0           ; /* User Flag 0                              */
__sbit __at (0xD4) RS1          ; /* Register Bank Select 1                   */
__sbit __at (0xD3) RS0          ; /* Register Bank Select 0                   */
__sbit __at (0xD2) OV           ; /* Overflow Flag                            */
__sbit __at (0xD1) F1           ; /* User Flag 1                              */
__sbit __at (0xD0) PARITY       ; /* Accumulator Parity Flag                  */

/* PCA0CN 0xD8 */
__sbit __at (0xDF) CF           ; /* PCA0 Counter Overflow Flag               */
__sbit __at (0xDE) CR           ; /* PCA0 Counter Run Control Bit             */
                                   /* Bit 5 unused                           */
__sbit __at (0xDC) CCF4         ; /* PCA0 Module 4 Capture/Compare Flag       */
__sbit __at (0xDB) CCF3         ; /* PCA0 Module 3 Capture/Compare Flag       */
__sbit __at (0xDA) CCF2         ; /* PCA0 Module 2 Capture/Compare Flag       */
__sbit __at (0xD9) CCF1         ; /* PCA0 Module 1 Capture/Compare Flag       */
__sbit __at (0xD8) CCF0         ; /* PCA0 Module 0 Capture/Compare Flag       */

/* ADC0CN 0xE8 */
__sbit __at (0xEF) AD0EN        ; /* ADC0 Enable                              */
__sbit __at (0xEE) AD0TM        ; /* ADC0 Track Mode Bit                      */
__sbit __at (0xED) AD0INT       ; /* ADC0 Conversion Complete Interrupt Flag  */
__sbit __at (0xEC) AD0BUSY      ; /* ADC0 Busy Flag                           */
__sbit __at (0xEB) AD0WINT      ; /* ADC0 Window Compare Interrupt Flag       */
__sbit __at (0xEA) AD0CM2       ; /* ADC0 Start Of Conversion Mode Bit 2      */
__sbit __at (0xE9) AD0CM1       ; /* ADC0 Start Of Conversion Mode Bit 1      */
__sbit __at (0xE8) AD0CM0       ; /* ADC0 Start Of Conversion Mode Bit 0      */

/* SPI0CN 0xF8 */
__sbit __at (0xFF) SPIF         ; /* SPI0 Interrupt Flag                      */
__sbit __at (0xFE) WCOL         ; /* SPI0 Write Collision Flag                */
__sbit __at (0xFD) MODF         ; /* SPI0 Mode Fault Flag                     */
__sbit __at (0xFC) RXOVRN       ; /* SPI0 RX Overrun Flag                     */
__sbit __at (0xFB) NSSMD1       ; /* SPI0 Slave Select Mode 1                 */
__sbit __at (0xFA) NSSMD0       ; /* SPI0 Slave Select Mode 0                 */
__sbit __at (0xF9) TXBMT        ; /* SPI0 TX Buffer Empty Flag                */
__sbit __at (0xF8) SPIEN        ; /* SPI0 Enable                              */

//-----------------------------------------------------------------------------
// Interrupt Priorities
//-----------------------------------------------------------------------------

#define INTERRUPT_INT0             0   // External Interrupt 0
#define INTERRUPT_TIMER0           1   // Timer 0 Overflow
#define INTERRUPT_INT1             2   // External Interrupt 1
#define INTERRUPT_TIMER1           3   // Timer 1 Overflow
#define INTERRUPT_UART0            4   // UART0
#define INTERRUPT_TIMER2           5   // Timer 2 Overflow
#define INTERRUPT_SPI0             6   // SPI0
#define INTERRUPT_SMBUS0           7   // SMBus0 Interface
#define INTERRUPT_USB0           8   // SMBus0 Interface
#define INTERRUPT_ADC0_WINDOW      9   // ADC0 Window Comparison
#define INTERRUPT_ADC0_EOC         10   // ADC0 End Of Conversion
#define INTERRUPT_PCA0            11   // PCA0 Peripheral
#define INTERRUPT_COMPARATOR0     12   // Comparator 0 Comparison
#define INTERRUPT_COMPARATOR1     13   // Comparator 1 Comparison
#define INTERRUPT_TIMER3          14   // Timer 3 Overflow
#define INTERRUPT_VBUS            15   // VBus Interrupt
#define INTERRUPT_UART1           16   // UART1
#define INTERRUPT_SMBUS1           18   // SMBus1 Interface
#define INTERRUPT_TIMER4          19   // Timer 4 Overflow
#define INTERRUPT_TIMER5          20   // Timer 5 Overflow

#endif                                 /* #define __C8051F380_H__            */
